[
  {
    "id": "peanut-chocolate-balls",
    "title": "Peanut-Chocolate Balls",
    "image": "images/recipes/peanut-chocolate-balls.jpg",
    "description": "Rich, chocolatey, and deeply satisfying — a homemade vegan treat made with simple pantry ingredients.",
    "category": "Desserts",
    "cookingTime": "25 minutes",
    "difficulty": "Easy",
    "servings": "7 balls",
    "ingredients": {
      "Filling": [
        "Roasted peanuts – ½ cup",
        "Dates (soft, pitted) – 8",
        "Oats – 2 tbsp",
        "Cocoa powder – 1½ tbsp",
        "Neutral oil (sunflower/refined) – 1 tbsp",
        "Salt – a pinch",
        "Vanilla essence – optional"
      ],
      "Chocolate Coating": [
        "Compound dark chocolate – 100 g",
        "Neutral oil – 1½ tsp"
      ]
    },
    "instructions": [
      "Dry roast peanuts until aromatic. Cool completely and crush coarsely. Keep 1–2 tablespoons aside.",
      "Blend dates into a paste. Add oats, cocoa powder, oil, salt, and vanilla. Mix until thick and sticky. Fold in crushed peanuts.",
      "Take 1 level tablespoon of mixture and roll into smooth balls. Refrigerate for 15–20 minutes.",
      "Melt chocolate using a double boiler. Add oil and stir until smooth and glossy. Mix in reserved peanuts.",
      "Dip chilled balls into melted chocolate. Place on parchment and refrigerate for 15 minutes until set."
    ],
    "tips": "Store refrigerated in an airtight container for up to 5–7 days."
  },

  {
    "id": "microwave-potato-chips",
    "title": "Microwave Potato Chips",
    "image": "images/recipes/microwave-potato-chips.jpg",
    "description": "Crispy, thin potato chips made effortlessly in the microwave using minimal oil.",
    "category": "Snacks",
    "cookingTime": "8–10 minutes",
    "difficulty": "Easy",
    "servings": "2",
    "ingredients": {
      "Main Ingredients": [
        "Potatoes (medium-sized) – 2",
        "Neutral oil – 1 to 1½ tsp"
      ],
      "Seasoning": [
        "Chaat masala – to taste",
        "Black salt – to taste",
        "Kashmiri red chilli powder – to taste"
      ]
    },
    "instructions": [
      "Wash potatoes thoroughly. Do not peel.",
      "Slice very thinly using a mandolin.",
      "Rinse slices in water 2–3 times to remove excess starch.",
      "Drain and pat completely dry using a kitchen towel.",
      "Toss slices with oil until lightly coated.",
      "Arrange slices in a single layer on a greased microwave-safe plate.",
      "Microwave on high for 5–8 minutes, checking and rearranging every 2 minutes.",
      "Remove once lightly golden and crisp. Rest for 1–2 minutes.",
      "Season while warm and toss gently to coat."
    ],
    "tips": "Slice thickness and microwave power vary. Always monitor closely otherwise might burn. Take the chips out while its hot otherwise will stick to the plate once hardens."
  },

  {
    "id": "chocolate-cake",
    "title": "Chocolate Cake",
    "image": "images/recipes/chocolate-cake.jpg",
    "description": "A soft, moist, and deeply chocolatey vegan cake made without eggs or dairy — perfect for celebrations or everyday indulgence.",
    "category": "Desserts",
    "cookingTime": "45 minutes",
    "difficulty": "Medium",
    "servings": "6-8",
    "ingredients": {
      "Dry Ingredients": [
        "¾ cup whole wheat flour",
        "3 tablespoons cocoa powder",
        "½ cup powdered white sugar",
        "¾ teaspoon baking powder",
        "¼ teaspoon baking soda",
        "1 pinch salt",
        "¼ teaspoon coffee powder"
      ],
      "Wet Ingredients": [
        "3 tablespoons sunflower oil",
        "¼ cup peanut curd",
        "¼ cup plant milk (almond, oat, soy — room temperature)",
        "1 teaspoon vinegar"
      ],
      "Optional for Extra Richness": ["25 g vegan dark chocolate, melted"],
      "Thick Vegan Chocolate Ganache": [
        "100 g vegan dark chocolate, finely chopped",
        "2–3 tablespoons hot plant milk",
        "1 teaspoon sunflower oil"
      ]
    },
    "instructions": [
      "Grease a 7-inch round cake tin. Line the base with parchment paper or lightly dust with flour.",
      "Preheat oven: 180°C (350°F) for 10 minutes.<br> Or, Preheat kadhai: Heat on low flame with lid for 10 minutes.",
      "In a bowl, whisk together peanut curd, sunflower oil, plant milk, and vinegar until smooth.",
      "Sieve together whole wheat flour, cocoa powder, powdered sugar, baking powder, baking soda, salt, and coffee powder.",
      "Add dry ingredients to wet mix in two parts. Fold gently with a spatula until just combined. Do not overmix.",
      "Add melted chocolate (optional): Fold in 25 g melted dark chocolate for extra richness.",
      "Pour batter into prepared pan. Tap gently to release air bubbles. Bake at 180°C — Oven: 30–35 minutes or Kadai: 40–45 minutes on low flame. Toothpick should come out with moist crumbs (not wet batter).",
      "Let cake cool 10 minutes in pan, then turn out onto a rack. Cool completely (at least 1 hour) before slicing.",
      "Make Thick Ganache: Melt 100 g dark chocolate. Add 2–3 tablespoons hot plant milk gradually, mixing until glossy. Stir in 1 tsp sunflower oil. Rest 10–15 minutes until thick and spreadable.",
      "Slice and Assemble: Slice cooled cake into 2 layers. Spread ganache on bottom layer. Place second layer on top. Spread remaining ganache on top and sides. Smooth with spatula."
    ],
    "tips": "Measure ingredients carefully. Cool cake fully before frosting. Use same plant milk in ganache for best texture. Sift dry ingredients for a lighter cake."
  },

  {
    "id": "velvet-veggie-pasta",
    "title": "Velvet Veggie Pasta",
    "image": "images/recipes/velvet-veggie-pasta.jpg",
    "description": "A smooth, creamy Indian-style vegan pasta made with blended vegetables and tomato — light, comforting, and naturally rich without dairy.",
    "category": "Main Course",
    "cookingTime": "30 minutes",
    "difficulty": "Easy",
    "servings": "2",
    "ingredients": {
      "Pasta": [
        "Pasta (penne, fusilli, or macaroni) – 150 g",
        "Salt – for boiling water"
      ],
      "Vegetables for Sauce": [
        "Carrot – 1 medium, chopped",
        "Cauliflower florets – ½ cup",
        "Tomato – 1 medium, chopped",
        "Onion – ½ medium, chopped",
        "Garlic – 2 cloves"
      ],
      "Seasoning & Finishing": [
        "Olive oil / sunflower oil – 1½ tbsp",
        "Water or vegetable stock – 1 cup",
        "Lemon juice – ¾ tsp",
        "Black pepper – ⅛ tsp",
        "Salt – to taste",
        "Red chilli flakes or Kashmiri red chilli powder – optional"
      ],
      "Garnish": ["Fresh coriander or parsley – as needed"]
    },
    "instructions": [
      "Boil pasta in salted water until al dente. Drain and reserve 2–3 tablespoons of pasta water.",
      "Heat oil in a pan. Sauté onion and garlic for 1–2 minutes until fragrant.",
      "Add carrot, cauliflower, and tomato. Pour in water or vegetable stock and cook covered for 8–10 minutes until vegetables are very soft.",
      "Transfer the cooked vegetables along with the cooking liquid to a blender. Blend until completely smooth and creamy.",
      "Pour the blended sauce back into the pan. Add salt, black pepper, lemon juice, and chilli flakes if using. Heat gently.",
      "Adjust sauce consistency using reserved pasta water if required.",
      "Add cooked pasta to the sauce and toss gently until evenly coated.",
      "Serve hot, garnished with fresh coriander or parsley. Optionally drizzle a little olive oil on top."
    ],
    "tips": "For extra creaminess, ensure vegetables are fully cooked before blending. Do not overheat after adding lemon juice to keep flavors balanced."
  }
]
